In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
df=sns.load_dataset("titanic")  # sea born küt. data yükle
df=sns.load_dataset("")

In [5]:
df.head() # beş satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
### aggregate function

In [8]:
df.dtypes        #tipler df.typesssss

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [10]:
df_number=df.select_dtypes(include=["float64","int64"])
df_number.head()          #int 64 yok

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [13]:
df_number=df.select_dtypes(include=["float64","int64"])
df_number.head()           #int 32 yok

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [14]:
df_number.aggregate(["min","max"])     # min ve max ı getir tablo içinde

     survived  pclass    age  sibsp  parch      fare
min         0       1   0.42      0      0    0.0000
max         1       3  80.00      8      6  512.3292

In [16]:
df_number.aggregate(["count"])       # saydı getir tablo içinde

       survived  pclass  age  sibsp  parch  fare
count       891     891  714    891    891   891

In [17]:
df_number.aggregate(["average"])    #ortalama

         survived    pclass  age     sibsp     parch       fare
average  0.383838  2.308642  NaN  0.523008  0.381594  32.204208

In [19]:
df_number.aggregate([np.median])    # medyan noları

        survived  pclass   age  sibsp  parch     fare
median       0.0     3.0  28.0    0.0    0.0  14.4542

In [20]:
df_number.agg(["mean",np.median])  #ort ve medyan medyan numpaydan pandas da da var

        survived    pclass        age     sibsp     parch       fare
mean    0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
median  0.000000  3.000000  28.000000  0.000000  0.000000  14.454200

In [25]:
df_number.agg({"survived":"mean","pclass":min, "age":max})  #ort,min ve max al

survived     0.383838
pclass       1.000000
age         80.000000
dtype: float64

In [29]:
def f(x):
    return x.mean()-x.std()   # ort dan standart sapma çıkardı

In [30]:
df_number.aggregate(f)    # f içine değer vermene gerek yok

survived    -0.102754
pclass       1.472571
age         15.172620
sibsp       -0.579736
parch       -0.424464
fare       -17.489221
dtype: float64

In [31]:
f(df_number)

survived    -0.102754
pclass       1.472571
age         15.172620
sibsp       -0.579736
parch       -0.424464
fare       -17.489221
dtype: float64

In [41]:
df_number.agg(["std","mean",f])   # stn aspma, ort ve f fonk göre farkı

      survived    pclass        age     sibsp     parch       fare
std   0.486592  0.836071  14.526497  1.102743  0.806057  49.693429
mean  0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
f    -0.102754  1.472571  15.172620 -0.579736 -0.424464 -17.489221

In [35]:
df_number.agg(["min","mean",f])

      survived    pclass        age     sibsp     parch       fare
min   0.000000  1.000000   0.420000  0.000000  0.000000   0.000000
mean  0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
f    -0.102754  1.472571  15.172620 -0.579736 -0.424464 -17.489221

In [36]:
fonk=["max","mean","std"]

In [38]:
df_number["age"].agg(fonk)  # age e max,ort ve std ver

max     80.000000
mean    29.699118
std     14.526497
Name: age, dtype: float64

In [45]:
df_number.agg([sum,max,"count"])

       survived  pclass       age  sibsp  parch        fare
sum         342    2057  21205.17    466    340  28693.9493
max           1       3     80.00      8      6    512.3292
count       891     891    714.00    891    891    891.0000

In [ ]:
### GROUPBY grafikle göstermede var

In [108]:
import pandas as pd
import numpy as np
import seaborn as sns

In [109]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [110]:
df.groupby("pclass").mean()  # pclasa göre gruplamayı yaptı  ortalama

,survived,age,sibsp,parch,fare,adult_male,alone
pclass,,,,,,,
1,0.629630,38.233441,0.416667,0.356481,84.154687,0.550926,0.504630
2,0.472826,29.877630,0.402174,0.380435,20.662183,0.538043,0.565217
3,0.242363,25.140620,0.615071,0.393075,13.675550,0.649695,0.659878

In [111]:
df.groupby("pclass")["survived"].mean()
# DATASERİES gruplamayı yaşamına baktı data seriii

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [112]:
df.groupby("pclass")[["survived"]].mean()  
#  DATAFRAME data frame yaptı

        survived
pclass
1       0.629630
2       0.472826
3       0.242363

In [113]:
df.groupby("who")["sex"].count()

who
child     83
man      537
woman    271
Name: sex, dtype: int64

In [114]:
df.groupby(["sex"]).count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [115]:
df["sex"].value_counts()   # cinsiyetleri say

male      577
female    314
Name: sex, dtype: int64

In [116]:
df.groupby("sex")["survived"].value_counts().unstack() # cinsiyete göre kim hayatta kalmış

survived    0    1
sex
female     81  233
male      468  109

In [117]:
df.groupby("sex")["pclass"].value_counts().unstack()  # seyahat claslara göre cinsiyet sayılarını belirledik.

pclass    1    2    3
sex
female   94   76  144
male    122  108  347

In [118]:
df.groupby(["sex","pclass"])["survived"].mean().unstack()   # df yaptı [[]] iç içe olunca

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [119]:
df.groupby(["sex","pclass"])["survived"].mean()  # unstack yapıncada dataframe yaptık

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

In [120]:
df["survived"].groupby([df["sex"],df["pclass"],df["class"]]).value_counts().unstack()  #yaşama göre gruplayın sex,pclass,class

survived                0   1
sex    pclass class
female 1      First     3  91
       2      Second    6  70
       3      Third    72  72
male   1      First    77  45
       2      Second   91  17
       3      Third   300  47

In [126]:
df.groupby("sex")[["pclass"]].mean()  # cinsiyete göre oran

          pclass
sex
female  2.159236
male    2.389948

In [128]:
df.groupby("sex")["pclass"].value_counts().unstack()  # cinsiyete göre sayılar

pclass    1    2    3
sex
female   94   76  144
male    122  108  347